# WhileScanningParametersForType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..WhileScanningParametersForType Property
BuiltInFailures..::..FamilyFailures Class See Also
---
While loading Type '[Name]', parameter '[Name]': [Description]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WhileScanningParametersForType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WhileScanningParametersForType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WhileScanningParametersForType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace